ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
/*
*********************************************************************************************
*                                       天津华宁电子有限公司
*                             			   开发一部
*
*                                    CORTEX STM32F103系列模板文件
*
*
* 文件名 : _STM32DRV.c
* 作  者 : 赵健胜
* 版  本 : V1.0
* 日  期 : 2009-08-29
*********************************************************************************************
*                                              描 述
*
*         该源文件中提供CORTEX 常用外设的初始化配置,使用时根据需要可以更改
*
*********************************************************************************************
*/


/********************************************************************************************
*                                               头文件
********************************************************************************************/
#include "BSP_STM32Lib.h"

/********************************************************************************************
*                                               宏定义
********************************************************************************************/

#define ADC1_DR_Address    ((u32)0x4001244C)

/********************************************************************************************
*                                              常量定义
********************************************************************************************/

/********************************************************************************************
*                                              变量定义
********************************************************************************************/
volatile u32 TimingDelay; //该变量需要在中断处理文件中声明
volatile u32 SysTickTimer;
volatile u8 SysTickTimeUp;
vu16 ADCConvertedValue[80] = {0};
/********************************************************************************************
*                                              函数声明
********************************************************************************************/



/****************************************************************************
* 函数名称: RCCInit_Base
* 功能描述: 系统时钟及外设时钟源初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明: 
****************************************************************************/
void RCCInit_Base(void)
{
	RCC_DeInit();							               // RCC配置为默认模式
	/* Enable HSI */
    RCC_AdjustHSICalibrationValue(0x0f);
    RCC_HSICmd(ENABLE);					                   // 允许内部高速时钟

	/* HCLK = SYSCLK */
	RCC_HCLKConfig(RCC_SYSCLK_Div2);		               // 系统时钟分频(1,2,4,8-512),2分频	AHB clock
	  
	/* PCLK2 = HCLK */
	RCC_PCLK2Config(RCC_HCLK_Div1);			               // APB2分频(1,2,4-16),1分频,最大72MHz
	
	/* PCLK1 = HCLK/2 */
	RCC_PCLK1Config(RCC_HCLK_Div2);			               // APB1分频(1,2,4-16),2分频,最大36MHz
	FLASH_SetLatency(FLASH_Latency_2);		               // SYSCLK(系统时钟)周期与闪存访问时间的比例
												           // FLASH_Latency_0:零等待状态,当0<SYSCLK≤24MHz
												           // FLASH_Latency_1:一个等待状态,当24MHz<SYSCLK≤48MHz
												           // FLASH_Latency_2:两个等待状态,当48MHz<SYSCLK≤72MHz
	
	FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);	// 使能闪存预取缓冲区

	/* PLLCLK = 4MHz * 12 = 48 MHz */
    RCC_PLLConfig(RCC_PLLSource_HSI_Div2, RCC_PLLMul_12);	// PLL倍频系数,12倍频
	
    /* Enable PLL */ 
	RCC_PLLCmd(ENABLE);						                // 使能PLL
	
	/* Wait till PLL is ready */
	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET){};	// 等待PLL正常
	
	/* Select PLL as system clock source */
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);	            // 选择PLL作为系统时钟Fcclk
	
	/* Wait till PLL is used as system clock source */
	while(RCC_GetSYSCLKSource() != 0x08){};	                // 等待PLL作为系统时钟正常

}




/****************************************************************************
* 函数名称: DMAInit_Base
* 功能描述: ADC1初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void NVICInit_Base(void)
{
//	NVIC_InitTypeDef NVIC_InitStructure;
    	
	// 设置中断向量表空间
#ifdef  VECT_TAB_RAM  
  	/* Set the Vector Table base location at 0x20000000 */ 
  	NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */
  	/* Set the Vector Table base location at 0x08000000 */ 
  	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   
#endif

    /* 配置可抢占中断优先级 */
//    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);



}

#ifdef SYSTICK_EN

/****************************************************************************
* 函数名称: SysTick_Init_Base
* 功能描述: 系统时钟初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明: 该函数只能在前后台系统中用，用作延时函数。在带操作系统（UCOS和RTX）
*           情况下不能使用 。
*           条件：外部晶振为8MHz，系统时钟为72MHz，SysTick的频率9MHz，SysTick产生1ms的中断。
****************************************************************************/
void SysTickInit_Base(void)
{
	SysTick_SetReload(9000);	                                  // 设定SysTick达到1ms计数结束
	SysTick_ITConfig(ENABLE);                                     // 使能SysTick中断
}
/****************************************************************************
* 函数名称: SysTickHandleFun
* 功能描述: 系统时钟中断处理函数
* 入口参数: 无
* 出口参数: 无
* 使用说明: 该函数只能在前后台系统中用，用作延时函数。在带操作系统（UCOS和RTX）
*           情况下不能使用 
****************************************************************************/
void SysTickHandleFun (void) 
{
	if (TimingDelay != 0x00)
	TimingDelay--;

	if(SysTickTimer != 0x00){
		SysTickTimer --;
	}else{
		SysTickTimeUp = 1;
		SysTickTimer = 0x0F;
	}
}
/****************************************************************************
* 函数名称: Delay
* 功能描述: 使用SysTick的延时处理函数
* 入口参数: 无
* 出口参数: 无
* 使用说明: 该函数只能在前后台系统中用，用作延时函数。在带操作系统（UCOS和RTX）
*           情况下不能使用。
*           使用条件：调用SysTickInit_Base（）完成初始化 。在SystickHandle中调用
*			中断处理函数SysTickHandler。
*           延时时间为：nTime × 1ms
****************************************************************************/
void Delay(u32 nTime)
{
	SysTick_CounterCmd(SysTick_Counter_Enable); // 使能SysTick计数器
	TimingDelay = nTime; // 读取延时时间
	while(TimingDelay != 0); // 判断延时是否结束
	SysTick_CounterCmd(SysTick_Counter_Disable); // 关闭SysTick计数器
	SysTick_CounterCmd(SysTick_Counter_Clear); // 清除SysTick计数器
}

#endif  /*end SYSTICK_EN*/

#ifdef TIMER1_EN
/****************************************************************************
* 函数名称: Timer1Init_Base
* 功能描述: 定时器1初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer1Init_Base(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	
