ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);

	#ifdef TIMER1_INT_EN

	/*配置定时器1使能中断--------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM1_CC_IRQChannel;    //配置定时器1中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM1, TIM_FLAG_Update);                           // 清除TIM1溢出中断标志
 	
   	TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);                      //TIM1溢出中断允许

}

#endif

#ifdef TIMER2_EN
/****************************************************************************
* 函数名称: Timer2Init_Base
* 功能描述: 定时器2初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer2Init_Base(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);

	#ifdef TIMER2_INT_EN
    
	/*配置定时器2使能中断--------------------------------------------------*/
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;

    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM2, TIM_FLAG_Update);                           // 清除TIM2溢出中断标志
 	
   	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);                      //TIM2溢出中断允许

}
#endif

#ifdef TIMER3_EN
/****************************************************************************
* 函数名称: Timer3Init_Base
* 功能描述: 定时器3初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer3Init_Base(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);

	#ifdef TIMER3_INT_EN
	
	/*配置定时器3使能中断---------------------------------------------------*/
	NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM3, TIM_FLAG_Update);                           // 清除TIM3溢出中断标志
 	
   	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);                      //TIM3溢出中断允许

}

#endif

#ifdef TIMER4_EN
/****************************************************************************
* 函数名称: Timer4Init_Base
* 功能描述: 定时器4初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer4Init_Base(void)
{
	
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);

	#ifdef TIMER4_INT_EN
	/*配置定时器4使能中断---------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQChannel;       //配置定时器4中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);

	#endif
	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM4, TIM_FLAG_Update);                           // 清除TIM4溢出中断标志
 	
   	TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);                      //TIM4溢出中断允许

}
#endif

#ifdef TIMER5_EN
/****************************************************************************
* 函数名称: Timer4Init_Base
* 功能描述: 定时器4初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer5Init_Base(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5,ENABLE);

	#ifdef TIMER5_INT_EN
	/*配置定时器5使能中断---------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQChannel;       //配置定时器5中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure);
 	                                                 
