ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
   	TIM_ClearFlag(TIM5, TIM_FLAG_Update);                           // 清除TIM5溢出中断标志
 	
   	TIM_ITConfig(TIM5, TIM_IT_Update, ENABLE);                      //TIM5溢出中断允许

}
#endif

#ifdef TIMER6_EN
/****************************************************************************
* 函数名称: Timer6Init_Base
* 功能描述: 定时器6初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer6Init_Base(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6,ENABLE);

	#ifdef TIMER6_INT_EN
	
	/*配置定时器6使能中断---------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM6_IRQChannel;       //配置定时器6中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM6, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM6, TIM_FLAG_Update);                           // 清除TIM6溢出中断标志
 	
   	TIM_ITConfig(TIM6, TIM_IT_Update, ENABLE);                      //TIM6溢出中断允许

}
#endif

#ifdef TIMER7_EN
/****************************************************************************
* 函数名称: Timer7Init_Base
* 功能描述: 定时器7初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer7Init_Base(void)
{

	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7,ENABLE);

	#ifdef TIMER7_INT_EN
	
	/*配置定时器7使能中断---------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQChannel;       //配置定时器7中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM7, TIM_FLAG_Update);                           // 清除TIM7溢出中断标志
 	
   	TIM_ITConfig(TIM7, TIM_IT_Update, ENABLE);                      //TIM7溢出中断允许

}

#endif

#ifdef TIMER8_EN
/****************************************************************************
* 函数名称: Timer8Init_Base
* 功能描述: 定时器8初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void Timer8Init_Base(void)
{

	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8,ENABLE);

	#ifdef TIMER8_INT_EN
	
	/*配置定时器8使能中断---------------------------------------------------*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM8_CC_IRQChannel;       //配置定时器8中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
	#endif

	TIM_TimeBaseStructure.TIM_Period = 0x5DC0;                      //最大计数值24000 产生１ＭＳ时基　t = Rperiod/(计数器时钟／(分频数加１))       
	TIM_TimeBaseStructure.TIM_Prescaler = 0x09;                     //0x90分频为分频数加1;      	
	TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;                  // 时钟分割  	//计数器时钟为48MHz
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //计数方向向上计数
	TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure);
 	                                                 
   	TIM_ClearFlag(TIM8, TIM_FLAG_Update);                           // 清除TIM8溢出中断标志
 	
   	TIM_ITConfig(TIM8, TIM_IT_Update, ENABLE);                      //TIM8溢出中断允许

}
#endif


#ifdef RTC_EN
/****************************************************************************
* 函数名称: RTCInit_Base
* 功能描述: RTC初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void RTCInit_Base(void)
{
    /* Enable PWR and BKP clocks */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

	#ifdef RTC_INT_EN
                                      //???????????????????????????????????????
	#endif
	/* Allow access to BKP Domain */
    PWR_BackupAccessCmd(ENABLE);

    /* Reset Backup Domain */
    BKP_DeInit();

    /* 使能内部低速晶振 */
    RCC_LSICmd(ENABLE);
    /* Wait till LSE is ready */
    while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
    {}

    /* Select LSE as RTC Clock Source */
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);

    /* Enable RTC Clock */
    RCC_RTCCLKCmd(ENABLE);

    /* Wait for RTC registers synchronization */
    RTC_WaitForSynchro();

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();

    /* Enable the RTC Second */
    RTC_ITConfig(RTC_IT_SEC, ENABLE);

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();

    /* Set RTC prescaler: set RTC period to 1sec */
    RTC_SetPrescaler(39999); /* RTC period = RTCCLK/RTC_PR = (40 KHz)/(39999+1) */

