ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();

}


#endif /*RTC_EN*/

#ifdef ADC1_EN
/****************************************************************************
* 函数名称: ADC1Init_Base
* 功能描述: ADC1初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void ADC1Init_Base(void)
{
    GPIO_InitTypeDef GPIO_InitStructure; 
	ADC_InitTypeDef ADC_InitStructure;
	/*使能用到的时钟资源*/
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA
	 						|RCC_APB2Periph_GPIOB
	 						|RCC_APB2Periph_GPIOC,
							ENABLE);
 
	/* ADC1 对应的16个采集通道配置 ------------------------------------*/
    /*输入端口A配置*/
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|
                                  GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /*输入端口B配置*/
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /*输入端口C配置*/
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

	#ifdef AD1_INT_EN
                                        //????????????????????????????????????????????????????????????????
	#endif

    /* ADC1 配置 ------------------------------------------------------*/
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 16;	                    //用于转换的通道数
    ADC_Init(ADC1, &ADC_InitStructure);

    /* ADC1 规则模式通道配置 */ 
    ADC_RegularChannelConfig(ADC1, ADC_Channel_9, 1, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 2, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_15, 3, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_14, 4, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 5, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_6, 6, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_5, 7, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_4, 8, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 9, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_2,10, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_1,11, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_0,12, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_13,13, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_12,14, ADC_SampleTime_55Cycles5);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_11,15, ADC_SampleTime_55Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_10,16, ADC_SampleTime_55Cycles5);
    /* Enable ADC1 DMA */
    ADC_DMACmd(ADC1, ENABLE);
  
    /* 启动ADC1 */
    ADC_Cmd(ADC1, ENABLE);


	// 下面是ADC自动校准，开机后需执行一次，保证精度
    /* 使能ADC1复位校正*/   
    ADC_ResetCalibration(ADC1);
    /* */
    while(ADC_GetResetCalibrationStatus(ADC1));

    /* 开始ADC1复位校正 */
    ADC_StartCalibration(ADC1);
    /* 检验是否校正完毕 */
    while(ADC_GetCalibrationStatus(ADC1));
	// ADC自动校准结束---------------
//     
//    /* 开启ADC1转换 */ 
//    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}
/****************************************************************************
* 函数名称: ADC1_Start
* 功能描述: ADC1启动
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void ADC1_Start(void)
{
	/* 开启ADC1转换 */ 
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

#endif /*ADC1_EN*/



#ifdef DMA_EN

/****************************************************************************
* 函数名称: DMAInit_Base
* 功能描述: ADC1初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void DMAInit_Base(void)
{
    DMA_InitTypeDef DMA_InitStructure;
	
	/*DMA1通道１配置 ----------------------------------------------*/
    DMA_DeInit(DMA1_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
    DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&ADCConvertedValue[0];
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;		  //dma传输方向单向
    DMA_InitStructure.DMA_BufferSize = 80;					  //设置DMA在传输时缓冲区的长度
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;  //设置DMA的外设递增模式
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;		   //设置DMA的内存递增模式
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;	 //转换结果的数据大小
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;					  //设置DMA的传输模式：连续不断的循环模式
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);
  
    /* 使能DMA1通道１*/
    DMA_Cmd(DMA1_Channel1, ENABLE);

}
#endif /*ADC_EN*/

#ifdef FSMC_EN
/****************************************************************************
* 函数名称: FSMCInit_Base
* 功能描述: FSMC初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void FSMCInit_Base(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
	FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
	FSMC_NORSRAMTimingInitTypeDef  p;
  
/* 使能 FSMC 时钟及对应数据总线线、地址线总线、控制线的时钟源------------- */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD 
						   |RCC_APB2Periph_GPIOE 
						   |RCC_APB2Periph_GPIOF
						   |RCC_APB2Periph_GPIOG,
						   ENABLE);

