ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
	/* 配置USART1的时钟--------------------------------------------------- */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	/* 配置USART1的GPIO--------------------------------------------------- */
	/* 配置USART2 Tx (PA.02)****/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//？？？？？？？要开启AFIO？？？？
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* 配置USART2 Rx (PA.03) */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	#ifdef USART2_INT_EN
	/* 配置USART2使能中断-------------------------------------------------- */
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	#endif

    USART_InitStructure.USART_BaudRate = 9600;			   //初始化usart2参数配置
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART1, &USART_InitStructure);
	USART_Cmd(USART1, DISABLE);
	USART_ITConfig(USART2, USART_IT_TXE, ENABLE);		  //使能发送中断
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);		  //使能接受中断

}

#endif /*USART2_EN*/


#ifdef CAN_EN
/****************************************************************************
* 函数名称: CANInit_Base
* 功能描述: CAN 初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void CANInit_Base(void)
{
    GPIO_InitTypeDef       GPIO_InitStructure;
	NVIC_InitTypeDef       NVIC_InitStructure;
	CAN_InitTypeDef        CAN_InitStructure;
	CAN_FilterInitTypeDef  CAN_FilterInitStructure;
	/*CAN用到的数据总线配置*/
	/* 配置 CAN－RX pin(PA.11)*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
  
	/* 配置 CAN-TX pin(PA.12) */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	#ifdef CAN_INT_EN
	/* 使能CAN RX0 接收*/

    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN_RX0_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

	CAN_ITConfig(CAN_IT_FMP0, ENABLE);
	#endif
	
    /* 配置CAN 单元  */
    CAN_InitStructure.CAN_TTCM = DISABLE;
    CAN_InitStructure.CAN_ABOM = DISABLE;
    CAN_InitStructure.CAN_AWUM = DISABLE;
    CAN_InitStructure.CAN_NART = DISABLE;
    CAN_InitStructure.CAN_RFLM = DISABLE;
    CAN_InitStructure.CAN_TXFP = DISABLE;
    CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
    CAN_InitStructure.CAN_BS1 = CAN_BS1_8tq;
    CAN_InitStructure.CAN_BS2 = CAN_BS2_7tq;
    CAN_InitStructure.CAN_Prescaler = 5;
    CAN_Init(&CAN_InitStructure);

    /* 配置CAN 过滤器 共有14个下面为其中一个的配置 */
    CAN_FilterInitStructure.CAN_FilterNumber=0;
    CAN_FilterInitStructure.CAN_FilterMode=CAN_FilterMode_IdMask;
    CAN_FilterInitStructure.CAN_FilterScale=CAN_FilterScale_32bit;
    CAN_FilterInitStructure.CAN_FilterIdHigh=0x0000;
    CAN_FilterInitStructure.CAN_FilterIdLow=0x0000;
    CAN_FilterInitStructure.CAN_FilterMaskIdHigh=0x0000;
    CAN_FilterInitStructure.CAN_FilterMaskIdLow=0x0000;
    CAN_FilterInitStructure.CAN_FilterFIFOAssignment=0;
    CAN_FilterInitStructure.CAN_FilterActivation=ENABLE;
    CAN_FilterInit(&CAN_FilterInitStructure);

}

#endif /*CAN_EN*/


#ifdef SPI1_EN
/****************************************************************************
* 函数名称: SPI1Init_Base
* 功能描述: SPI1初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void SPI1Init_Base(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
//	NVIC_InitTypeDef NVIC_InitStructure;
	SPI_InitTypeDef   SPI_InitStructure;

	/* 配置SPI1时钟源 ----------------------------------------------------*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1,ENABLE);
	
	/* 配置SPI1 引脚: SCK, MISO and MOSI ---------------------------------*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	#ifdef SPI1_INT_EN
                               //???????????????????????????????????????????????????/

	#endif

	/* SPI1 配置*/
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_Init(SPI1, &SPI_InitStructure);
}
/****************************************************************************
* 函数名称: SPI1_SendData
* 功能描述: SPI1数据发送函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void SPI1_SendData(u8 data)
{
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI_I2S_SendData(SPI1, data);
}

#endif /*SPI1_EN*/
#ifdef SPI2_EN
/****************************************************************************
* 函数名称: SPI2Init_Base
* 功能描述: SPI2初始化函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void SPI2Init_Base(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	SPI_InitTypeDef   SPI_InitStructure;//????????????????????????????????????????????????????????????/

	/* 配置SPI1时钟源 ----------------------------------------------------*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI2,ENABLE);

