ztyhalo/quan/zlp/定制SP模块程序A1.1/Libraries/BSP/_STM32DRV.C
	/* 配置SPI2 引脚: SCK, MISO and MOSI ---------------------------------*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	#ifdef SPI2_INT_EN
                               //???????????????????????????????????????????????????/

	#endif

	/* SPI2 配置*/
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_Init(SPI2, &SPI_InitStructure);
	//此处添加代码
}

#endif /*SPI2_EN*/

#ifdef IWATCHDOG_EN
/****************************************************************************
* 函数名称: IWDGInit_Base
* 功能描述: 看门狗初始化配置函数
* 入口参数: 无
* 出口参数: 无
* 使用说明:
****************************************************************************/
void IWDGInit_Base(void)
{

	#ifdef IWATCHDOG_INT_EN

	#endif
	if (RCC_GetFlagStatus(RCC_FLAG_IWDGRST) != RESET)
    {
        RCC_ClearFlag();
    }
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  /*使能写IWDG_PR and IWDG_RLR*/
    
    IWDG_SetPrescaler(IWDG_Prescaler_64);          /* 看门狗时钟: 40KHz(LSI) / 64 = 0.6125 KHz */
    IWDG_SetReload(4095);                          /*定时2S*/
    IWDG_ReloadCounter();                   
    IWDG_Enable();                                 /*使能看门狗(the LSI oscillator will be enabled by hardware) */

}
#endif

/****************************************END OF FILE************************/

